Stable_version_after_mermaid
